Revit 2027 API
LinePatternElement.GetLinePatternElementByName Method
 Retrieves the LinePatternElement by its name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinePatternElement GetLinePatternElementByName(
	Document document,
	string name
)
Public Shared Function GetLinePatternElementByName (
	document As Document,
	name As String
) As LinePatternElement
public:
static LinePatternElement^ GetLinePatternElementByName(
	Document^ document,
	String^ name
)
static member GetLinePatternElementByName :
        document : Document *
        name : string -> LinePatternElement
Parameters
document Document
 The document in which to retrieve the LinePatternElement.
name String
 The name of the LinePatternElement.
Return Value
LinePatternElement
 The LinePatternElement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinePatternElement Class
Autodesk.Revit.DB Namespace